IDEA StatiCa Open Model
RebarStirrups Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The RebarStirrups type exposes the following members.
Properties
Name | Description
Diameter
 Gets or sets the Rebar Diameter.
 (Inherited from RebarBase.)
GroupId
 identity for group identification number
 (Inherited from RebarBase.)
Id
 Element Id
 (Inherited from OpenElementId.)
Material
 Gets or sets the reference of material properties.
 (Inherited from RebarBase.)
Patterns
 Gets or sets the pattern of the rebar grouping. Holds distance between rebars/stirrups and length
RebarAllocationElement
 the element where this rebar belongs (part of that beam)
 (Inherited from RebarBase.)
RebarParentElement
 Gets or sets the reference element of the geometry of the reference line (line along which the rebars are generated). It can be IdeaRS.OpenModel.Geometry3D.Segment3D or IdeaRS.OpenModel.Geometry3D.PolyLine3D or IdeaRS.OpenModel.Model.Member1D or IdeaRS.OpenModel.Model.Element1D
 (Inherited from RebarBase.)
RebarShape
 Gets or sets the geometrical shape of the rebar. IdeaRS.OpenModel.Model.RebarShape
 (Inherited from RebarBase.)
Top
See Also
Reference
RebarStirrups Class
IdeaRS.OpenModel.Model Namespace